Part 5 Steady Flow/20-mesh-3/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

setFormat       raw;

writeControl    writeTime; // this ensures that it's writing only at writeInterval

sets
(

    // make sure to change (x1 y1 z1) and (x2 y2 z2) to
    // the coordinates of the start and end points

    line1 
    {
        type    lineCell;
        axis    xyz;
        start   (0.3536 0.3536 0.0);
        end     (0.707107 0.707107 0.0);
    }

    line2
    {
        type    lineCell;
        axis    xyz;
        start   (0.0 0.5 0.0);
        end     (0.0 1.0 0.0);
    }

    line3
    {
        type    lineCell;
        axis    xyz;
        start   (-0.3536 0.3536 0.0);
        end     (-0.707107 0.707107 0.0);
    }
);

fields          ( p U );


// ************************************************************************* //
